Revit 2027 API
MetalPatternType Enumeration
 The enumerated type representing the permitted values for the asset property "MetalPattern" from the "Metal" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum MetalPatternType
Public Enumeration MetalPatternType
public enum class MetalPatternType
type MetalPatternType
Members
Member name | Value | Description
CheckerPlate | 3
Custom | 4
DiamondPlate | 2
Knurl | 1
None | 0
See Also
Reference
Autodesk.Revit.DB.Visual Namespace